In [1]:
import pandas as pd
import numpy as np

# Question 1

In [8]:
#Q1

df1= pd.DataFrame(pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/salarydata.csv"))
df2= pd.DataFrame(pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/nba.csv"))
df3= pd.DataFrame(pd.read_csv("https://raw.githubusercontent.com/kglan/MSDS/main/DATA602/Gathering%20and%20loading%20data%20with%20Pandas/LuxuryLoanPortfolio.csv"))
df4= pd.DataFrame(pd.read_csv("https://raw.githubusercontent.com/kglan/MSDS/main/DATA602/Gathering%20and%20loading%20data%20with%20Pandas/Customers.csv"))

# Question 2

In [14]:
#Q2
df1

                   Sate  2018 Mean Annual Wage  Unnamed: 2
0               Alabama                 90,620         NaN
1                 Alaska                99,180         NaN
2                Arizona                88,800         NaN
3               Arkansas                81,430         NaN
4             California                97,110         NaN
5               Colorado                82,560         NaN
6            Connecticut                96,010         NaN
7               Delaware                93,880         NaN
8   District of Columbia                89,880         NaN
9                Florida                87,410         NaN
10               Georgia                86,320         NaN
11                Hawaii                90,540         NaN
12                 Idaho                77,700         NaN
13              IIIinois                90,690         NaN
14               lndiana                83,680         NaN
15                  lowa                82,960         NaN
16                Kansas                85,250         NaN
17              Kentucky                84,630         NaN
18             Louisiana                89,860         NaN
19                 Maine                79,910         NaN
20              Maryland                85,170         NaN
21         Massachusetts                91,750         NaN
22              Michigan                91,160         NaN
23             Minnesota                83,750         NaN
24           Mississippi                89,720         NaN
25              Missouri                81,330         NaN
26               Montana                79,050         NaN
27              Nedraska                80,130         NaN
28                Nevada               107,920         NaN
29         New Hampshire                82,880         NaN
30            New Jersey                97,770         NaN
31           New  Mexico                97,210         NaN
32              New York                87,470         NaN
33        North Carolina                87,560         NaN
34          North Dakota                78,120         NaN
35                  Ohio                86,690         NaN
36              Okahoma                 84,860         NaN
37                Oregon                85,890         NaN
38          Pennsylvania                87,050         NaN
39          Rhode Island                83,850         NaN
40        South Carolina                85,450         NaN
41          South Dakota                92,940         NaN
42             Tennessee                85,940         NaN
43                 Taxas                92,940         NaN
44                  Utah                85,940         NaN
45               Vermont                75,010         NaN
46              Virginia                91,700         NaN
47            Washington                85,930         NaN
48         West Virginia                89,420         NaN
49             Wisconsin                85,200         NaN
50               Wyomimg                87,510         NaN

In [15]:
df2

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df3

,loan_id,funded_amount,funded_date,duration years,duration months,10 yr treasury index date funded,interest rate percent,interest rate,payments,total past payments,...,BUILDING CLASS AT PRESENT,ADDRESS 1,ADDRESS 2,ZIP CODE,CITY,STATE,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,TAX CLASS AT TIME OF SALE
0,LL0000076,790000.0,2012-04-27,20,240,1.96,3.359,0.03359,4524.65,92,...,R1,171 SOUTH 9TH STREET,9,10001,New York City,NY,1,0,0,2
1,LL0000151,1720000.0,2014-10-14,15,180,2.21,3.508,0.03508,12302.74,62,...,R3,1242 E 80TH ST,19,10104,New York City,NY,1,0,0,1
2,LL0000161,3720000.0,2014-06-07,15,180,2.60,3.896,0.03896,27322.92,66,...,R3,1884 53RD STREET,2,10029,New York City,NY,1,0,0,1
3,LL0000175,1079000.0,2012-02-23,20,240,1.99,3.389,0.03389,6196.40,94,...,R1,79 EAGLE STREET,6,10010,New York City,NY,1,0,0,2
4,LL0000178,2028000.0,2016-04-01,20,240,1.79,3.188,0.03188,11439.05,45,...,RW,34 NORTH 7TH STREET,5,10172,New York City,NY,1,0,0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1673,LL0001228,528000.0,2012-11-10,20,240,1.61,3.010,0.03009,2930.65,85,...,R6,1554 49TH STREET,1,10158,New York City,NY,1,0,0,1
1674,LL0001358,885000.0,2015-08-16,20,240,2.20,3.599,0.03599,5177.78,52,...,R6,1554 49TH STREET,2,10108,New York City,NY,1,0,0,1
1675,LL0001479,1530000.0,2014-09-01,20,240,2.35,3.749,0.03748,9069.60,64,...,R6,1554 49TH STREET,3,10166,New York City,NY,1,0,0,1
1676,LL0001561,897000.0,2014-02-14,15,180,2.75,4.049,0.04049,6657.05,70,...,RR,828 BEDFORD AVENUE,2,10081,New York City,NY,11,0,16376,2
1677,LL0001674,1656000.0,2016-07-12,15,180,1.53,2.828,0.02828,11299.54,41,...,R8,828 BEDFORD AVENUE,1,10022,New York City,NY,1,0,0,2

In [17]:
df4

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

# Question 3

In [44]:
#Q3
print(df1.shape, df1.dtypes, '\n','\n',
df2.shape,df2.dtypes, '\n', '\n',
df4.shape,df4.dtypes, )

(51, 3) Sate                      object
2018 Mean Annual Wage     object
Unnamed: 2               float64
dtype: object

 (458, 9) Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

 (2000, 8) CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Profession                object
Work Experience            int64
Family Size                int64
dtype: object

In [45]:
print(df3.shape,df3.dtypes)

(1678, 32) loan_id                              object
funded_amount                       float64
funded_date                          object
duration years                        int64
duration months                       int64
10 yr treasury index date funded    float64
interest rate percent               float64
interest rate                       float64
payments                            float64
total past payments                   int64
loan balance                        float64
property value                      float64
purpose                              object
firstname                            object
middlename                           object
lastname                             object
social                               object
phone                                object
title                                object
employment length                     int64
BUILDING CLASS CATEGORY              object
TAX CLASS AT PRESENT                 object
BUILDING CLASS AT PRESENT            object
ADDRESS 1                            object
ADDRESS 2                            object
ZIP CODE                              int64
CITY                                 object
STATE                                object
TOTAL UNITS                           int64
LAND SQUARE FEET                     object
GROSS SQUARE FEET                    object
TAX CLASS AT TIME OF SALE             int64
dtype: object

# Question 4

In [53]:
df1.describe

<bound method NDFrame.describe of                    Sate  2018 Mean Annual Wage  Unnamed: 2
0               Alabama                 90,620         NaN
1                 Alaska                99,180         NaN
2                Arizona                88,800         NaN
3               Arkansas                81,430         NaN
4             California                97,110         NaN
5               Colorado                82,560         NaN
6            Connecticut                96,010         NaN
7               Delaware                93,880         NaN
8   District of Columbia                89,880         NaN
9                Florida                87,410         NaN
10               Georgia                86,320         NaN
11                Hawaii                90,540         NaN
12                 Idaho                77,700         NaN
13              IIIinois                90,690         NaN
14               lndiana                83,680         NaN
15                  lowa                82,960         NaN
16                Kansas                85,250         NaN
17              Kentucky                84,630         NaN
18             Louisiana                89,860         NaN
19                 Maine                79,910         NaN
20              Maryland                85,170         NaN
21         Massachusetts                91,750         NaN
22              Michigan                91,160         NaN
23             Minnesota                83,750         NaN
24           Mississippi                89,720         NaN
25              Missouri                81,330         NaN
26               Montana                79,050         NaN
27              Nedraska                80,130         NaN
28                Nevada               107,920         NaN
29         New Hampshire                82,880         NaN
30            New Jersey                97,770         NaN
31           New  Mexico                97,210         NaN
32              New York                87,470         NaN
33        North Carolina                87,560         NaN
34          North Dakota                78,120         NaN
35                  Ohio                86,690         NaN
36              Okahoma                 84,860         NaN
37                Oregon                85,890         NaN
38          Pennsylvania                87,050         NaN
39          Rhode Island                83,850         NaN
40        South Carolina                85,450         NaN
41          South Dakota                92,940         NaN
42             Tennessee                85,940         NaN
43                 Taxas                92,940         NaN
44                  Utah                85,940         NaN
45               Vermont                75,010         NaN
46              Virginia                91,700         NaN
47            Washington                85,930         NaN
48         West Virginia                89,420         NaN
49             Wisconsin                85,200         NaN
50               Wyomimg                87,510         NaN>

In [50]:
df2.describe

<bound method NDFrame.describe of               Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]>

In [51]:
df3.describe

<bound method NDFrame.describe of         loan_id  funded_amount funded_date  duration years  duration months  \
0     LL0000076       790000.0  2012-04-27              20              240
1     LL0000151      1720000.0  2014-10-14              15              180
2     LL0000161      3720000.0  2014-06-07              15              180
3     LL0000175      1079000.0  2012-02-23              20              240
4     LL0000178      2028000.0  2016-04-01              20              240
...         ...            ...         ...             ...              ...
1673  LL0001228       528000.0  2012-11-10              20              240
1674  LL0001358       885000.0  2015-08-16              20              240
1675  LL0001479      1530000.0  2014-09-01              20              240
1676  LL0001561       897000.0  2014-02-14              15              180
1677  LL0001674      1656000.0  2016-07-12              15              180

      10 yr treasury index date funded  interest rate percent  interest rate  \
0                                 1.96                  3.359        0.03359
1                                 2.21                  3.508        0.03508
2                                 2.60                  3.896        0.03896
3                                 1.99                  3.389        0.03389
4                                 1.79                  3.188        0.03188
...                                ...                    ...            ...
1673                              1.61                  3.010        0.03009
1674                              2.20                  3.599        0.03599
1675                              2.35                  3.749        0.03748
1676                              2.75                  4.049        0.04049
1677                              1.53                  2.828        0.02828

      payments  total past payments  ...  BUILDING CLASS AT PRESENT  \
0      4524.65                   92  ...                         R1
1     12302.74                   62  ...                         R3
2     27322.92                   66  ...                         R3
3      6196.40                   94  ...                         R1
4     11439.05                   45  ...                         RW
...        ...                  ...  ...                        ...
1673   2930.65                   85  ...                         R6
1674   5177.78                   52  ...                         R6
1675   9069.60                   64  ...                         R6
1676   6657.05                   70  ...                         RR
1677  11299.54                   41  ...                         R8

                   ADDRESS 1 ADDRESS 2 ZIP CODE           CITY STATE  \
0     171 SOUTH 9TH   STREET         9    10001  New York City    NY
1             1242 E 80TH ST        19    10104  New York City    NY
2           1884 53RD STREET         2    10029  New York City    NY
3            79 EAGLE STREET         6    10010  New York City    NY
4      34 NORTH 7TH   STREET         5    10172  New York City    NY
...                      ...       ...      ...            ...   ...
1673      1554 49TH   STREET         1    10158  New York City    NY
1674      1554 49TH   STREET         2    10108  New York City    NY
1675      1554 49TH   STREET         3    10166  New York City    NY
1676      828 BEDFORD AVENUE         2    10081  New York City    NY
1677      828 BEDFORD AVENUE         1    10022  New York City    NY

     TOTAL UNITS LAND SQUARE FEET GROSS SQUARE FEET  TAX CLASS AT TIME OF SALE
0              1                0                 0                          2
1              1                0                 0                          1
2              1                0                 0                          1
3              1                0                 0                          2
4              1                0                 0                          4
...          ...              ...               ...                        ...
1673           1                0                 0                          1
1674           1                0                 0                          1
1675           1                0                 0                          1
1676          11                0             16376                          2
1677           1                0                 0                          2

[1678 rows x 32 columns]>

In [52]:
df4.describe

<bound method NDFrame.describe of       CustomerID  Gender  Age  Annual Income ($)  Spending Score (1-100)  \
0              1    Male   19              15000                      39
1              2    Male   21              35000                      81
2              3  Female   20              86000                       6
3              4  Female   23              59000                      77
4              5  Female   31              38000                      40
...          ...     ...  ...                ...                     ...
1995        1996  Female   71             184387                      40
1996        1997  Female   91              73158                      32
1997        1998    Male   87              90961                      14
1998        1999    Male   77             182109                       4
1999        2000    Male   90             110610                      52

         Profession  Work Experience  Family Size
0        Healthcare                1            4
1          Engineer                3            3
2          Engineer                1            1
3            Lawyer                0            2
4     Entertainment                2            6
...             ...              ...          ...
1995         Artist                8            7
1996         Doctor                7            7
1997     Healthcare                9            2
1998      Executive                7            2
1999  Entertainment                5            2

[2000 rows x 8 columns]>

# Question 5

In [61]:
print(df1.head(),'\n','\n',
df1.tail())

        Sate  2018 Mean Annual Wage  Unnamed: 2
0    Alabama                 90,620         NaN
1      Alaska                99,180         NaN
2     Arizona                88,800         NaN
3    Arkansas                81,430         NaN
4  California                97,110         NaN

             Sate  2018 Mean Annual Wage  Unnamed: 2
46       Virginia                91,700         NaN
47     Washington                85,930         NaN
48  West Virginia                89,420         NaN
49      Wisconsin                85,200         NaN
50        Wyomimg                87,510         NaN

In [62]:
print(df2.head(),'\n','\n',
df2.tail())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

              Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

In [63]:
print(df3.head(),'\n','\n',
df3.tail())

     loan_id  funded_amount funded_date  duration years  duration months  \
0  LL0000076       790000.0  2012-04-27              20              240
1  LL0000151      1720000.0  2014-10-14              15              180
2  LL0000161      3720000.0  2014-06-07              15              180
3  LL0000175      1079000.0  2012-02-23              20              240
4  LL0000178      2028000.0  2016-04-01              20              240

   10 yr treasury index date funded  interest rate percent  interest rate  \
0                              1.96                  3.359        0.03359
1                              2.21                  3.508        0.03508
2                              2.60                  3.896        0.03896
3                              1.99                  3.389        0.03389
4                              1.79                  3.188        0.03188

   payments  total past payments  ...  BUILDING CLASS AT PRESENT  \
0   4524.65                   92  ...                         R1
1  12302.74                   62  ...                         R3
2  27322.92                   66  ...                         R3
3   6196.40                   94  ...                         R1
4  11439.05                   45  ...                         RW

                ADDRESS 1 ADDRESS 2 ZIP CODE           CITY STATE TOTAL UNITS  \
0  171 SOUTH 9TH   STREET         9    10001  New York City    NY           1
1          1242 E 80TH ST        19    10104  New York City    NY           1
2        1884 53RD STREET         2    10029  New York City    NY           1
3         79 EAGLE STREET         6    10010  New York City    NY           1
4   34 NORTH 7TH   STREET         5    10172  New York City    NY           1

  LAND SQUARE FEET GROSS SQUARE FEET  TAX CLASS AT TIME OF SALE
0                0                 0                          2
1                0                 0                          1
2                0                 0                          1
3                0                 0                          2
4                0                 0                          4

[5 rows x 32 columns]

         loan_id  funded_amount funded_date  duration years  duration months  \
1673  LL0001228       528000.0  2012-11-10              20              240
1674  LL0001358       885000.0  2015-08-16              20              240
1675  LL0001479      1530000.0  2014-09-01              20              240
1676  LL0001561       897000.0  2014-02-14              15              180
1677  LL0001674      1656000.0  2016-07-12              15              180

      10 yr treasury index date funded  interest rate percent  interest rate  \
1673                              1.61                  3.010        0.03009
1674                              2.20                  3.599        0.03599
1675                              2.35                  3.749        0.03748
1676                              2.75                  4.049        0.04049
1677                              1.53                  2.828        0.02828

      payments  total past payments  ...  BUILDING CLASS AT PRESENT  \
1673   2930.65                   85  ...                         R6
1674   5177.78                   52  ...                         R6
1675   9069.60                   64  ...                         R6
1676   6657.05                   70  ...                         RR
1677  11299.54                   41  ...                         R8

               ADDRESS 1 ADDRESS 2 ZIP CODE           CITY STATE TOTAL UNITS  \
1673  1554 49TH   STREET         1    10158  New York City    NY           1
1674  1554 49TH   STREET         2    10108  New York City    NY           1
1675  1554 49TH   STREET         3    10166  New York City    NY           1
1676  828 BEDFORD AVENUE         2    10081  New York City    NY          11
1677  828 BEDFORD AVENUE         1    10022  New York City    NY           1

     LAND SQUARE FEET GROSS SQUARE FEET  TAX CLASS AT TIME OF SALE
1673                0                 0                          1
1674                0                 0                          1
1675                0                 0                          1
1676                0             16376                          2
1677                0                 0                          2

[5 rows x 32 columns]

In [64]:
print(df4.head(),'\n','\n',
df4.tail())

   CustomerID  Gender  Age  Annual Income ($)  Spending Score (1-100)  \
0           1    Male   19              15000                      39
1           2    Male   21              35000                      81
2           3  Female   20              86000                       6
3           4  Female   23              59000                      77
4           5  Female   31              38000                      40

      Profession  Work Experience  Family Size
0     Healthcare                1            4
1       Engineer                3            3
2       Engineer                1            1
3         Lawyer                0            2
4  Entertainment                2            6

       CustomerID  Gender  Age  Annual Income ($)  Spending Score (1-100)  \
1995        1996  Female   71             184387                      40
1996        1997  Female   91              73158                      32
1997        1998    Male   87              90961                      14
1998        1999    Male   77             182109                       4
1999        2000    Male   90             110610                      52

         Profession  Work Experience  Family Size
1995         Artist                8            7
1996         Doctor                7            7
1997     Healthcare                9            2
1998      Executive                7            2
1999  Entertainment                5            2

# Extra Credit

In [68]:
# Extra Credit
dfecredit = pd.DataFrame(pd.read_csv("https://raw.githubusercontent.com/kglan/MSDS/main/DATA602/Gathering%20and%20loading%20data%20with%20Pandas/Customers_ExtraCredit.csv"))
dfecredit.head

<bound method NDFrame.head of          1    Male  19   15000  39     Healthcare  1.1  4
0        2    Male  21   35000  81       Engineer    3  3
1        3  Female  20   86000   6       Engineer    1  1
2        4  Female  23   59000  77         Lawyer    0  2
3        5  Female  31   38000  40  Entertainment    2  6
4        6  Female  22   58000  76         Artist    0  2
...    ...     ...  ..     ...  ..            ...  ... ..
1994  1996  Female  71  184387  40         Artist    8  7
1995  1997  Female  91   73158  32         Doctor    7  7
1996  1998    Male  87   90961  14     Healthcare    9  2
1997  1999    Male  77  182109   4      Executive    7  2
1998  2000    Male  90  110610  52  Entertainment    5  2

[1999 rows x 8 columns]>

In [69]:
dfecredit.columns = ['CustomerID', 'Gender', 'Age', 'Annual Income ($)', 'Spending Score (1-100)', 'Profession', 'Work Experience', 'Family Size']
dfecredit.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,2,Male,21,35000,81,Engineer,3,3
1,3,Female,20,86000,6,Engineer,1,1
2,4,Female,23,59000,77,Lawyer,0,2
3,5,Female,31,38000,40,Entertainment,2,6
4,6,Female,22,58000,76,Artist,0,2